In [1]:
import pandas as pd
import numpy as np

In [2]:
%pwd

'c:\\Users\\shipr\\OneDrive\\Documents\\project\\Vaccine_Data_Analysis\\notebook'

In [3]:
import os 
os.chdir("..")

In [5]:
report = pd.read_excel('raw/reported-cases-data.xlsx')

In [ ]:
report.head()

,GROUP,CODE,NAME,YEAR,DISEASE,DISEASE_DESCRIPTION,CASES
0,COUNTRIES,ABW,Aruba,2023.0,CRS,Congenital rubella syndrome,0.0
1,COUNTRIES,ABW,Aruba,2023.0,DIPHTHERIA,Diphtheria,0.0
2,COUNTRIES,ABW,Aruba,2023.0,INVASIVE_MENING,Invasive meningococcal disease,1.0
3,COUNTRIES,ABW,Aruba,2023.0,MEASLES,Measles,NaN
4,COUNTRIES,ABW,Aruba,2023.0,MUMPS,Mumps,0.0

In [6]:
report.isnull().sum()

GROUP                      0
CODE                       1
NAME                       1
YEAR                       1
DISEASE                    1
DISEASE_DESCRIPTION        1
CASES                  19400
dtype: int64

In [7]:
report['CASES'].fillna(0, inplace=True)

C:\Users\shipr\AppData\Local\Temp\ipykernel_16876\1374407551.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  report['CASES'].fillna(0, inplace=True)

In [8]:
report.isnull().sum()

GROUP                  0
CODE                   1
NAME                   1
YEAR                   1
DISEASE                1
DISEASE_DESCRIPTION    1
CASES                  0
dtype: int64

In [9]:
report.isnull().sum()

GROUP                  0
CODE                   1
NAME                   1
YEAR                   1
DISEASE                1
DISEASE_DESCRIPTION    1
CASES                  0
dtype: int64

In [10]:
report.describe()

               YEAR         CASES
count  84869.000000  8.487000e+04
mean    2004.108261  3.450084e+03
std       12.591396  5.373614e+04
min     1980.000000  0.000000e+00
25%     1994.000000  0.000000e+00
50%     2005.000000  0.000000e+00
75%     2015.000000  2.000000e+01
max     2023.000000  4.583555e+06

In [11]:
report.head()

,GROUP,CODE,NAME,YEAR,DISEASE,DISEASE_DESCRIPTION,CASES
0,COUNTRIES,ABW,Aruba,2023.0,CRS,Congenital rubella syndrome,0.0
1,COUNTRIES,ABW,Aruba,2023.0,DIPHTHERIA,Diphtheria,0.0
2,COUNTRIES,ABW,Aruba,2023.0,INVASIVE_MENING,Invasive meningococcal disease,1.0
3,COUNTRIES,ABW,Aruba,2023.0,MEASLES,Measles,0.0
4,COUNTRIES,ABW,Aruba,2023.0,MUMPS,Mumps,0.0

In [12]:
# converting YEAR column to numeric type and handling errors, then converting to nullable integer type
report['YEAR'] = pd.to_numeric(report['YEAR'], errors='coerce').astype('Int64')

In [13]:
report.dtypes

GROUP                   object
CODE                    object
NAME                    object
YEAR                     Int64
DISEASE                 object
DISEASE_DESCRIPTION     object
CASES                  float64
dtype: object

In [14]:
report['CASES'] = pd.to_numeric(report['CASES'], errors='coerce').astype('Int64')

In [15]:
report.dtypes

GROUP                  object
CODE                   object
NAME                   object
YEAR                    Int64
DISEASE                object
DISEASE_DESCRIPTION    object
CASES                   Int64
dtype: object

In [16]:
report.sort_values(['YEAR'], ascending=[True], inplace=True)
report.reset_index(drop=True, inplace=True)

In [18]:
report.head()

       GROUP CODE      NAME  YEAR    DISEASE DISEASE_DESCRIPTION  CASES
0  COUNTRIES  THA  Thailand  1980      POLIO       Poliomyelitis    300
1  COUNTRIES  THA  Thailand  1980  PERTUSSIS           Pertussis   4820
2  COUNTRIES  ETH  Ethiopia  1980     YFEVER        Yellow fever      0
3  COUNTRIES  ETH  Ethiopia  1980   TTETANUS       Total tetanus    409
4  COUNTRIES  ZWE  Zimbabwe  1980    MEASLES             Measles  23650

In [19]:
# Remove rows where GROUP contains "Created"
report = report[~report['GROUP'].str.contains('Created', na=False)]

In [20]:
report.isnull().sum()

GROUP                  0
CODE                   0
NAME                   0
YEAR                   0
DISEASE                0
DISEASE_DESCRIPTION    0
CASES                  0
dtype: int64

In [21]:
report = report.to_excel("processed/cleaned-reported-cases-data.xlsx", index=False)